tutorials/modules/compressibleVoF/plateFilm/0/plate/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/movingWallRegion";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    plate_top
    {
        type            zeroGradient;
    }

    plate_to_region0_plate
    {
        type            zeroGradient;
    }

    bottom
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
}


// ************************************************************************* //
