tutorials/modules/compressibleVoF/plateFilm/0/plate/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/movingWallRegion";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    plate_top
    {
        type            slip;
    }

    plate_to_region0_plate
    {
        type            noSlip;
    }

    bottom
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
